[
    {
        "title": "Modern Family",
        "year": 2009,
        "genres": [
            "Comedy",
            "Drama",
            "Romance"
        ],
        "directors": [],
        "cast": [
            "Ed O'Neill",
            "Sofía Vergara",
            "Julie Bowen",
            "Ty Burrell",
            "Jesse Tyler Ferguson",
            "Eric Stonestreet",
            "Rico Rodriguez",
            "Nolan Gould",
            "Sarah Hyland",
            "Ariel Winter"
        ],
        "rating": 8.5,
        "plot": "Told from the perspective of an unseen documentary filmmaker, the series offers an honest, often-hilarious perspective of family life. Parents Phil and Claire yearn for an honest, open relationship with their three kids, but a daughter who is trying to grow up too fast, another who is too smart for her own good, and a rambunctious young son make it challenging. Claire's dad Jay and his Latina wife Gloria are raising two sons together, but people sometimes believe Jay to be Gloria's father. Jay's gay son Mitchell and his partner Cameron have adopted a little Asian girl, completing one big -- straight, gay, multicultural, traditional -- happy family.",
        "runtime": [
            "22"
        ],
        "num_episodes": "250"
    },
    {
        "title": "The X-Files",
        "year": 1993,
        "genres": [
            "Adventure",
            "Crime",
            "Drama",
            "Mystery",
            "Sci-Fi",
            "Thriller"
        ],
        "directors": [],
        "cast": [
            "Gillian Anderson",
            "David Duchovny",
            "Mitch Pileggi",
            "William B. Davis",
            "Robert Patrick",
            "Tom Braidwood",
            "Bruce Harwood",
            "Dean Haglund",
            "Annabeth Gish",
            "Nicholas Lea"
        ],
        "rating": 8.6,
        "plot": "Two FBI agents, Fox Mulder and Dana Scully work in an unassigned detail of the bureau called the X-Files investigating cases dealing with unexplained paranormal phenomena. Mulder, a true believer, and Scully, a skeptic, perceive their cases from stand points of science and the paranormal.",
        "runtime": [
            "45"
        ],
        "num_episodes": "217"
    },
    {
        "title": "Top Gear",
        "year": 2002,
        "genres": [
            "Adventure",
            "Sport",
            "Talk-Show"
        ],
        "directors": [],
        "cast": [
            "Richard Hammond",
            "Jeremy Clarkson",
            "James May",
            "The Stig",
            "Ben Collins",
            "Chris Harris",
            "Andrew Flintoff",
            "Paddy McGuinness",
            "Matt LeBlanc",
            "Rory Reid"
        ],
        "rating": 8.7,
        "plot": "Top Gear is a British motoring magazine and entertainment television programme about motor vehicles, primarily cars, and is now relaunched as a general motoring magazine show as of 2002, and becoming the most widely watched entertainment television programme in the world.",
        "runtime": [
            "60"
        ],
        "num_episodes": "328"
    },
    {
        "title": "Lucifer",
        "year": 2016,
        "genres": [
            "Crime",
            "Drama",
            "Fantasy"
        ],
        "directors": [],
        "cast": [
            "Tom Ellis",
            "Lauren German",
            "Kevin Alejandro",
            "D.B. Woodside",
            "Lesley-Ann Brandt",
            "Rachael Harris",
            "Aimee Garcia",
            "Scarlett Estevez",
            "Tricia Helfer",
            "Tom Welling"
        ],
        "rating": 8.0,
        "plot": "Lucifer Morningstar, bored from his sulking life in hell, comes to live in Los Angeles. While there, he helps humanity with its miseries through his experience and telepathic abilities to bring people's deepest desires and thoughts out of them. While meeting with a Detective in his nightclub (Lux), a shootout involving him and the Detective leads him to become an LAPD consultant who tries to punish people for their crimes through law and justice.",
        "runtime": [
            "45"
        ],
        "num_episodes": "93"
    },
    {
        "title": "Mad Men",
        "year": 2007,
        "genres": [
            "Drama"
        ],
        "directors": [],
        "cast": [
            "Jon Hamm",
            "Elisabeth Moss",
            "Vincent Kartheiser",
            "January Jones",
            "Christina Hendricks",
            "Aaron Staton",
            "Rich Sommer",
            "John Slattery",
            "Kiernan Shipka",
            "Robert Morse"
        ],
        "rating": 8.7,
        "plot": "The professional and personal lives of those who work in advertising on Madison Avenue - self-coined \"mad men\" - in the 1960s are presented. The stories focus on those at one of the avenue's smaller firms, Sterling Cooper, and its various incarnations over the decade. At the heart of these stories is Donald Draper, the creative genius of the company. That professional creative brilliance belies the fact of a troubled childhood, one that he would rather forget and not let anyone know about except for a select few, but one that shaped who he is as an adult and as an ad man in the need not only to sell products but sell himself to the outside world. His outward confidence also masks many insecurities as evidenced through his many vices, such as excessive smoking, drinking and womanizing - the latter despite being a family man - and how he deals with the aftermath of some of the negative aspects of his life.",
        "runtime": [
            "45"
        ],
        "num_episodes": "92"
    },
    {
        "title": "The Office",
        "year": 2005,
        "genres": [
            "Comedy"
        ],
        "directors": [],
        "cast": [
            "Rainn Wilson",
            "John Krasinski",
            "Jenna Fischer",
            "Leslie David Baker",
            "Brian Baumgartner",
            "Angela Kinsey",
            "Kate Flannery",
            "Phyllis Smith",
            "Creed Bratton",
            "Oscar Nuñez"
        ],
        "rating": 9.0,
        "plot": "A mediocre paper company in the hands of Scranton, PA branch manager Michael Scott. This mockumentary follows the everyday lives of the manager and the employees he \"manages.\" The crew follows the employees around 24/7 and captures their quite humorous and bizarre encounters as they will do what it takes to keep the company thriving.",
        "runtime": [
            "22"
        ],
        "num_episodes": "188"
    },
    {
        "title": "Better Call Saul",
        "year": 2015,
        "genres": [
            "Crime",
            "Drama"
        ],
        "directors": [],
        "cast": [
            "Bob Odenkirk",
            "Jonathan Banks",
            "Rhea Seehorn",
            "Patrick Fabian",
            "Michael Mando",
            "Giancarlo Esposito",
            "Michael McKean",
            "Tony Dalton",
            "Mark Margolis",
            "Kerry Condon"
        ],
        "rating": 9.0,
        "plot": "Before Saul Goodman, he was Jimmy McGill. And if you're calling Jimmy, you're in real trouble. The prequel to \"Breaking Bad\" follows small-time attorney, Jimmy McGill, as he transforms into Walter White's morally challenged lawyer, Saul Goodman.",
        "runtime": [
            "45"
        ],
        "num_episodes": "63"
    },
    {
        "title": "Avatar: The Last Airbender",
        "year": 2005,
        "genres": [
            "Animation",
            "Action",
            "Adventure",
            "Family",
            "Fantasy",
            "Mystery"
        ],
        "directors": [],
        "cast": [
            "Dee Bradley Baker",
            "Zach Tyler Eisen",
            "Mae Whitman",
            "Jack De Sena",
            "Dante Basco",
            "Michaela Jill Murphy",
            "Mako",
            "Grey Griffin",
            "André Sogliuzzo",
            "Cricket Leigh"
        ],
        "rating": 9.3,
        "plot": "The world is divided into four elemental nations: The Northern and Southern Water Tribes, the Earth Kingdom, the Fire Nation, and the Air Nomads. The Avatar upholds the balance between the nations, but everything changed when the Fire Nation invaded. Only the Avatar, master of all four elements, can stop them. But when the world needs him most, he vanishes. A hundred years later Katara and Sokka discover the new Avatar, an airbender named Aang. Together they must help Aang master the elements and save the world.",
        "runtime": [
            "23"
        ],
        "num_episodes": "62"
    },
    {
        "title": "The Expanse",
        "year": 2015,
        "genres": [
            "Drama",
            "Mystery",
            "Sci-Fi"
        ],
        "directors": [],
        "cast": [
            "Steven Strait",
            "Dominique Tipper",
            "Wes Chatham",
            "Shohreh Aghdashloo",
            "Cas Anvar",
            "Frankie Adams",
            "Cara Gee",
            "Shawn Doyle",
            "Thomas Jane",
            "Florence Faivre"
        ],
        "rating": 8.5,
        "plot": "Two hundred years from now the solar system has been colonized, and police detective Josephus Miller is given the assignment of finding an important missing woman. Meanwhile, an officer of an ice freighter sees what appears to be an unprovoked attack upon the ship by a craft from Mars. As news of the attack spreads, the incident's repercussions threaten to destabilize an already tenuous relationship between Earth, Mars and the asteroid belt.",
        "runtime": [
            "60"
        ],
        "num_episodes": "62"
    },
    {
        "title": "Bosch",
        "year": 2014,
        "genres": [
            "Crime",
            "Drama"
        ],
        "directors": [],
        "cast": [
            "Titus Welliver",
            "Jamie Hector",
            "Amy Aquino",
            "Lance Reddick",
            "Madison Lintz",
            "Troy Evans",
            "DaJuan Johnson",
            "Gregory Scott Cummins",
            "Scott Klace",
            "Mimi Rogers"
        ],
        "rating": 8.5,
        "plot": "Harry Bosch is a homicide detective in the LAPD. He is doggedly determined to solve the cases that come his way, relying on good old-fashioned police work: following leads, looking for the smallest of clues, gathering evidence. He doesn't always toe the party line which often gets him into trouble with his superiors but he always gets the perpetrator, which more than makes up for this.",
        "runtime": [
            "50"
        ],
        "num_episodes": "68"
    },
    {
        "title": "Justified",
        "year": 2010,
        "genres": [
            "Action",
            "Crime",
            "Drama",
            "Mystery",
            "Thriller",
            "Western"
        ],
        "directors": [],
        "cast": [
            "Timothy Olyphant",
            "Nick Searcy",
            "Joelle Carter",
            "Jacob Pitts",
            "Erica Tazel",
            "Walton Goggins",
            "Natalie Zea",
            "Jere Burns",
            "David Meunier",
            "Jonathan Kowalsky"
        ],
        "rating": 8.6,
        "plot": "U.S. Marshal Raylan Givens is a modern day nineteenth century-style lawman, enforcing his brand of justice in a way that puts a target on his back with criminals, and places him at odds with his bosses in the Marshal service. That conflict results in a reassignment for Givens to the U.S. District covering the town where he grew up. He is an anachronism, a tough, soft-spoken gentleman who finds his quarry fascinating, but never gives an inch. Dig under his placid skin and you'll find an angry man who grew up hard in rural Kentucky, with an outlaw father, who knows a lot more about who he doesn't want to be than who he really is.",
        "runtime": [
            "45"
        ],
        "num_episodes": "78"
    },
    {
        "title": "Psych",
        "year": 2006,
        "genres": [
            "Comedy",
            "Crime",
            "Mystery"
        ],
        "directors": [],
        "cast": [
            "James Roday Rodriguez",
            "Dulé Hill",
            "Timothy Omundson",
            "Corbin Bernsen",
            "Maggie Lawson",
            "Kirsten Nelson",
            "Liam James",
            "Sage Brocklebank",
            "Kurt Fuller",
            "Carlos McCullers II"
        ],
        "rating": 8.4,
        "plot": "Think you are psychic? Shawn Spencer (James Roday) makes his living pretending to be. Shawn and his best friend Burton \"Gus\" Gu ster (Dulé Hill) own a business called \"Psych\". They are able to stay in business only because of the cases they work with the Santa Barbara Police Department as psychics. Shawn and Gus go through many ups and downs trying to keep the ruse up. Can they pretend forever? Or is the world they built going to come crumbling down?",
        "runtime": [
            "44"
        ],
        "num_episodes": "121"
    },
    {
        "title": "Homeland",
        "year": 2011,
        "genres": [
            "Crime",
            "Drama",
            "Mystery",
            "Thriller"
        ],
        "directors": [],
        "cast": [
            "Claire Danes",
            "Mandy Patinkin",
            "Rupert Friend",
            "Maury Sterling",
            "F. Murray Abraham",
            "Damian Lewis",
            "Morena Baccarin",
            "Jackson Pace",
            "Morgan Saylor",
            "Diego Klattenhoff"
        ],
        "rating": 8.3,
        "plot": "The winner of 6 Emmy Awards including Outstanding Drama Series, Homeland is an edge-of-your-seat sensation. Marine Sergeant Nicholas Brody is both a decorated hero and a serious threat. CIA officer Carrie Mathison is tops in her field despite being bipolar. The delicate dance these two complex characters perform, built on lies, suspicion, and desire, is at the heart of this gripping, emotional thriller in which nothing short of the fate of our nation is at stake.",
        "runtime": [
            "60"
        ],
        "num_episodes": "96"
    },
    {
        "title": "Elementary",
        "year": 2012,
        "genres": [
            "Crime",
            "Drama",
            "Mystery"
        ],
        "directors": [],
        "cast": [
            "Jonny Lee Miller",
            "Lucy Liu",
            "Aidan Quinn",
            "Jon Michael Hill",
            "Jordan Gelber",
            "John Noble",
            "Ophelia Lovibond",
            "Nelsan Ellis",
            "Ato Essandoh",
            "Tim Guinee"
        ],
        "rating": 7.9,
        "plot": "In modern New York, the famous detective and mind of Sherlock Holmes teams up with Doctor Watson and the New York Police Department to solve all the crimes and capture all the criminals that threaten the streets of New York. They do everything that they can to keep New York safe.",
        "runtime": [
            "60"
        ],
        "num_episodes": "154"
    },
    {
        "title": "Ray Donovan",
        "year": 2013,
        "genres": [
            "Crime",
            "Drama"
        ],
        "directors": [],
        "cast": [
            "Liev Schreiber",
            "Eddie Marsan",
            "Dash Mihok",
            "Pooch Hall",
            "Kerris Dorsey",
            "Jon Voight",
            "Kate Moennig",
            "Devon Bagby",
            "Paula Malcomson",
            "Steven Bauer"
        ],
        "rating": 8.3,
        "plot": "Set in the sprawling mecca of the rich and famous, Ray Donovan does the dirty work for LA's top power players as the go-to guy who makes the problems of the city's celebrities, superstar athletes, and business moguls disappear. This powerful drama unfolds when his father is unexpectedly released from prison, setting off a chain of events that shakes the Donovan family to its core.",
        "runtime": [
            "60"
        ],
        "num_episodes": "82"
    },
    {
        "title": "American Horror Story",
        "year": 2011,
        "genres": [
            "Drama",
            "Horror",
            "Sci-Fi",
            "Thriller"
        ],
        "directors": [],
        "cast": [
            "Evan Peters",
            "Sarah Paulson",
            "Denis O'Hare",
            "Lily Rabe",
            "Kathy Bates",
            "Frances Conroy",
            "Emma Roberts",
            "Jessica Lange",
            "Billie Lourd",
            "Leslie Grossman"
        ],
        "rating": 8.0,
        "plot": "Physical and psychological horrors affect a decomposing family, workers and residents of an insane asylum, a coven of witches, a cast of circus freaks, the employees and guests at a struggling hotel, a family who moved into a mysterious farmhouse, the members of a small suburb in Michigan, the surviving members of the Apocalypse and the counselors of a creepy summer camp in this haunting anthology series, focusing on the themes of infidelity, sanity, oppression, discrimination, addiction and exploitation.",
        "runtime": [
            "60"
        ],
        "num_episodes": ""
    },
    {
        "title": "Billions",
        "year": 2016,
        "genres": [
            "Drama"
        ],
        "directors": [],
        "cast": [
            "Paul Giamatti",
            "Maggie Siff",
            "David Costabile",
            "Dola Rashad",
            "Daniel K. Isaac",
            "Jeffrey DeMunn",
            "Asia Kate Dillon",
            "Kelly AuCoin",
            "Damian Lewis",
            "Dan Soder"
        ],
        "rating": 8.3,
        "plot": "Billions is a complex drama about power politics in the world of New York high finance. Shrewd, savvy U.S. Attorney Chuck Rhoades and the brilliant, ambitious hedge fund king Bobby \"Axe\" Axelrod are on an explosive collision course, with each using all of his considerable smarts, power and influence to outmaneuver the other. The stakes are in the billions in this timely, provocative series.",
        "runtime": [
            "60"
        ],
        "num_episodes": "84"
    },
    {
        "title": "Power",
        "year": 2014,
        "genres": [
            "Crime",
            "Drama"
        ],
        "directors": [],
        "cast": [
            "Omari Hardwick",
            "Lela Loren",
            "Naturi Naughton",
            "Joseph Sikora",
            "Shane Johnson",
            "Rotimi",
            "Michael Rainey Jr.",
            "La La Anthony",
            "Jerry Ferrara",
            "50 Cent"
        ],
        "rating": 8.1,
        "plot": "\"Power\" is a visionary drama that straddles the glamorous Manhattan lifestyles of the rich and famous and the underworld of the international drug trade. The cast is led by Omari Hardwick as James \"Ghost\" St. Patrick, a man trying to escape his role as a drug kingpin for a legitimized life in the elite of NYC; Joseph Sikora as his brother in arms in the drug business, Tommy Egan; Naturi Naughton plays Ghost's fierce wife Tasha St. Patrick; and Lela Loren is his first love, Assistant U.S. Attorney Angela Valdes.",
        "runtime": [
            "60"
        ],
        "num_episodes": "63"
    },
    {
        "title": "The League",
        "year": 2009,
        "genres": [
            "Comedy",
            "Sport"
        ],
        "directors": [],
        "cast": [
            "Mark Duplass",
            "Jonathan Lajoie",
            "Nick Kroll",
            "Stephen Rannazzisi",
            "Paul Scheer",
            "Katie Aselton",
            "Jason Mantzoukas",
            "Alina Foley",
            "Nadine Velazquez",
            "Janina Gavankar"
        ],
        "rating": 8.2,
        "plot": "",
        "runtime": [
            "22"
        ],
        "num_episodes": "84"
    },
    {
        "title": "Only Fools and Horses",
        "year": 1981,
        "genres": [
            "Comedy"
        ],
        "directors": [],
        "cast": [
            "David Jason",
            "Nicholas Lyndhurst",
            "Roger Lloyd Pack",
            "Buster Merryfield",
            "John Challis",
            "Kenneth MacDonald",
            "Lennard Pearce",
            "Gwyneth Strong",
            "Sue Holderness",
            "Patrick Murray"
        ],
        "rating": 9.0,
        "plot": "Traders and brothers, Rodney and Derek \"Del Boy\" Trotter, work from the streets of London buying what they can from the auctions and flogging it down at the market, always saying \"This time next year, we'll be millionaires\". Their Granddad and, later in the series, Uncle Albert also live in their council flat as the wise old man saying their next scheme won't work and offering in their jokes.",
        "runtime": [
            "95"
        ],
        "num_episodes": "64"
    },
    {
        "title": "The 100",
        "year": 2014,
        "genres": [
            "Action",
            "Drama",
            "Sci-Fi"
        ],
        "directors": [],
        "cast": [
            "Eliza Taylor",
            "Marie Avgeropoulos",
            "Bob Morley",
            "Lindsey Morgan",
            "Richard Harmon",
            "Paige Turco",
            "Henry Ian Cusick",
            "Christopher Larkin",
            "Jarod Joseph",
            "Isaiah Washington"
        ],
        "rating": 7.5,
        "plot": "The series is set 97 years after a devastating nuclear war wiped out almost all life on Earth. The only known survivors are the residents of twelve space stations in Earth's orbit prior to the war. The space stations banded together to form a single massive station named \"The Ark\", where about 2,400 people live. Resources are scarce and all crimes no matter their nature or severity are punishable by death (\"floating\") unless the perpetrator is under 18 years of age. After the Ark's life support systems are found to be critically failing, one hundred juvenile prisoners are declared \"expendable\" and sent to the surface in a last ditch attempt to determine if Earth is habitable again. The teens arrive on a beautiful planet they have only seen from space. Confronting the dangers of this rugged new world, they struggle to form a tentative community. However they discover that not all humanity was wiped out. There are people on Earth who survived the war, called \"grounders\" by the 100. The Ark consists of the space stations previously representing the nations of the UK, USA, Australia, Canada, China, Japan, India, Russia, Venezuela, France, Brazil, and Uganda.",
        "runtime": [
            "43"
        ],
        "num_episodes": "100"
    },
    {
        "title": "Orange Is the New Black",
        "year": 2013,
        "genres": [
            "Comedy",
            "Crime",
            "Drama"
        ],
        "directors": [],
        "cast": [
            "Taylor Schilling",
            "Kate Mulgrew",
            "Uzo Aduba",
            "Danielle Brooks",
            "Dascha Polanco",
            "Selenis Leyva",
            "Nick Sandow",
            "Yael Stone",
            "Taryn Manning",
            "Jackie Cruz"
        ],
        "rating": 8.0,
        "plot": "",
        "runtime": [
            "60"
        ],
        "num_episodes": "91"
    },
    {
        "title": "The Good Wife",
        "year": 2009,
        "genres": [
            "Crime",
            "Drama",
            "Mystery"
        ],
        "directors": [],
        "cast": [
            "Julianna Margulies",
            "Matt Czuchry",
            "Christine Baranski",
            "Archie Panjabi",
            "Alan Cumming",
            "Josh Charles",
            "Makenzie Vega",
            "Chris Noth",
            "Graham Phillips",
            "Zach Grenier"
        ],
        "rating": 8.4,
        "plot": "The Good Wife is a drama starring Emmy Award winner Julianna Margulies as a wife and mother who must assume full responsibility for her family and re-enter the workforce after her husband's very public sex and political corruption scandal lands him in jail.",
        "runtime": [
            "43"
        ],
        "num_episodes": "156"
    },
    {
        "title": "Shameless",
        "year": 2011,
        "genres": [
            "Comedy",
            "Drama"
        ],
        "directors": [],
        "cast": [
            "William H. Macy",
            "Ethan Cutkosky",
            "Jeremy Allen White",
            "Shanola Hampton",
            "Steve Howey",
            "Emma Kenney",
            "Cameron Monaghan",
            "Emmy Rossum",
            "Michael Patrick McGill",
            "Jim Hoffmaster"
        ],
        "rating": 8.5,
        "plot": "Watch the Irish American family the Gallaghers dealing with their alcoholic father Frank. Fiona, the eldest daughter, takes the role of the parent to her five brothers and sisters. Lip, Ian, Debbie, Carl, and Liam deal with life on the South Side of Chicago. Fiona balances her sex life and raising her siblings. Every episode is another crazy situation that one or more of the Gallagher six get into. Watch them grow and learn how to make their way in life with what little they have.",
        "runtime": [
            "60"
        ],
        "num_episodes": "134"
    },
    {
        "title": "Homicide: Life on the Street",
        "year": 1993,
        "genres": [
            "Crime",
            "Drama",
            "Mystery",
            "Thriller"
        ],
        "directors": [],
        "cast": [
            "Richard Belzer",
            "Clark Johnson",
            "Yaphet Kotto",
            "Kyle Secor",
            "Andre Braugher",
            "Melissa Leo",
            "Reed Diamond",
            "Sharon Ziman",
            "Peter Gerety",
            "Jon Seda"
        ],
        "rating": 8.7,
        "plot": "A one-hour drama inspired by David Simon's acclaimed non-fiction book \"Homicide: A Year on the Killing Streets.\" It is at once a mundane yet compelling look in and around a Homicide unit of the Baltimore Police Department, a group of determined individuals who are committed to their grim job.",
        "runtime": [
            "60"
        ],
        "num_episodes": "122"
    },
    {
        "title": "The Wire",
        "year": 2002,
        "genres": [
            "Crime",
            "Drama",
            "Thriller"
        ],
        "directors": [],
        "cast": [
            "Dominic West",
            "John Doman",
            "Deirdre Lovejoy",
            "Wendell Pierce",
            "Lance Reddick",
            "Sonja Sohn",
            "Seth Gilliam",
            "Domenick Lombardozzi",
            "Clarke Peters",
            "Andre Royo"
        ],
        "rating": 9.3,
        "plot": "The streets of Baltimore as a microcosm of the US's war on drugs, and of US urban decay in general. Seen not only through the eyes of a few policemen and drug gang members but also the people who influence and inhabit their world - politicians, the media, drug addicts and everyday citizens.",
        "runtime": [
            "60"
        ],
        "num_episodes": "60"
    },
    {
        "title": "Game of Thrones",
        "year": 2011,
        "genres": [
            "Action",
            "Adventure",
            "Drama",
            "Fantasy"
        ],
        "directors": [],
        "cast": [
            "Peter Dinklage",
            "Lena Headey",
            "Kit Harington",
            "Emilia Clarke",
            "Sophie Turner",
            "Maisie Williams",
            "Nikolaj Coster-Waldau",
            "Iain Glen",
            "John Bradley",
            "Alfie Allen"
        ],
        "rating": 9.2,
        "plot": "In the mythical continent of Westeros, several powerful families fight for control of the Seven Kingdoms. As conflict erupts in the kingdoms of men, an ancient enemy rises once again to threaten them all. Meanwhile, the last heirs of a recently usurped dynasty plot to take back their homeland from across the Narrow Sea.",
        "runtime": [
            "60"
        ],
        "num_episodes": "74"
    },
    {
        "title": "Breaking Bad",
        "year": 2008,
        "genres": [
            "Crime",
            "Drama",
            "Thriller"
        ],
        "directors": [],
        "cast": [
            "Bryan Cranston",
            "Anna Gunn",
            "Aaron Paul",
            "Betsy Brandt",
            "RJ Mitte",
            "Dean Norris",
            "Bob Odenkirk",
            "Steven Michael Quezada",
            "Jonathan Banks",
            "Giancarlo Esposito"
        ],
        "rating": 9.5,
        "plot": "Walter White is a chemistry genius but works as a chemistry teacher at a high school in Albuquerque, New Mexico. His life drastically changes when he's diagnosed with stage III terminal lung cancer and given a prognosis of two years to live. To ensure that his pregnant wife and disabled teenage son have a financial future, he uses his chemistry background to create and sell the world's finest crystal methamphetamine. To sell his signature \"blue meth,\" he teams up with Jesse Pinkman, a former student of his. The meth makes them very rich very quickly, but it attracts the attention of his DEA brother-in-law, Hank. As Walter and Jesse's status in the drug world escalates, Walter becomes a dangerous criminal, and Jesse becomes a hot-headed salesman. Hank is always hot on his tail, forcing Walter to devise new ways to cover his tracks.",
        "runtime": [
            "45"
        ],
        "num_episodes": "62"
    },
    {
        "title": "Person of Interest",
        "year": 2011,
        "genres": [
            "Action",
            "Crime",
            "Drama",
            "Mystery",
            "Sci-Fi",
            "Thriller"
        ],
        "directors": [],
        "cast": [
            "Jim Caviezel",
            "Kevin Chapman",
            "Michael Emerson",
            "Amy Acker",
            "Taraji P. Henson",
            "Sarah Shahi",
            "John Nolan",
            "Enrico Colantoni",
            "Robert John Burke",
            "Al Sapienza"
        ],
        "rating": 8.5,
        "plot": "A billionaire software-genius named Harold Finch creates a Machine for the government that is designed to detect acts of terror before they can happen, by monitoring the entire world through every cell-phone, email and surveillance camera. Finch discovered that the machine sees everything, potential terrorist acts and violent crimes that involve ordinary people. When the government considered violent crimes between normal people \"irrelevant\", Finch built a back door into the system that gives him the social security number of a person involved in a future violent crime so he could act. Partnered with John Reese, an ex-CIA agent, the two work in secret to prevent violent crimes before they can happen. Eventually their activities lead to being hunted by the New York Police Department, CIA Agents in pursuit of Reese who was listed as dead, a computer hacker named Root who wants access to the Machine, and government officials who want to keep all knowledge of the Machine a complete secret.",
        "runtime": [
            "43"
        ],
        "num_episodes": "103"
    },
    {
        "title": "Scrubs",
        "year": 2001,
        "genres": [
            "Comedy",
            "Drama"
        ],
        "directors": [],
        "cast": [
            "Donald Faison",
            "John C. McGinley",
            "Ken Jenkins",
            "Zach Braff",
            "Sarah Chalke",
            "Neil Flynn",
            "Judy Reyes",
            "Robert Maschio",
            "Sam Lloyd",
            "Aloma Wright"
        ],
        "rating": 8.4,
        "plot": "Set in the fictional Sacred Heart hospital in California, John \"J.D\" Dorian makes his way through the overwhelming world of medicine, with the help of his best friend, his fellow rookie doctors, and the arrogant, but brilliant attending physician he views as his mentor.",
        "runtime": [
            "22"
        ],
        "num_episodes": "182"
    },
    {
        "title": "Married... with Children",
        "year": 1987,
        "genres": [
            "Comedy"
        ],
        "directors": [],
        "cast": [
            "Ed O'Neill",
            "Katey Sagal",
            "Amanda Bearse",
            "Christina Applegate",
            "David Faustino",
            "Buck",
            "Ted McGinley",
            "David Garrison",
            "Kevin Curran",
            "Lucky"
        ],
        "rating": 8.1,
        "plot": "With a pay check that is lower than what the local beggar is earning, and with a wife and two children whose only interest is to rob him of his last cents, shoe-salesman Al Bundy is lucky if he can sit down in front of the TV with an ice-cold beer, or sneak out to the local Nudy bar every Tuesday night. Life isn't what it used to be when he was the star of the high-school football team, and when he scored four touch-downs in a single game.",
        "runtime": [
            "22"
        ],
        "num_episodes": "263"
    },
    {
        "title": "Prison Break",
        "year": 2005,
        "genres": [
            "Action",
            "Crime",
            "Drama",
            "Mystery",
            "Thriller"
        ],
        "directors": [],
        "cast": [
            "Dominic Purcell",
            "Wentworth Miller",
            "Robert Knepper",
            "Amaury Nolasco",
            "Sarah Wayne Callies",
            "Wade Williams",
            "William Fichtner",
            "Paul Adelstein",
            "Rockmond Dunbar",
            "Jodi Lyn O'Keefe"
        ],
        "rating": 8.3,
        "plot": "An innocent man is framed for the homicide of the Vice President's brother and scheduled to be executed at a super-max penitentiary, thus it's up to his younger brother to save him with his genius scheme: install himself in the same prison by holding up a bank and, as the final month ticks away, launch the escape plan step-by-step to break the both of them out, with his full-body tattoo acting as his guide; a tattoo which hides the layout of the prison facility and necessary clues vital to the escape.",
        "runtime": [
            "44"
        ],
        "num_episodes": "90"
    },
    {
        "title": "How I Met Your Mother",
        "year": 2005,
        "genres": [
            "Comedy",
            "Drama",
            "Romance"
        ],
        "directors": [],
        "cast": [
            "Josh Radnor",
            "Jason Segel",
            "Cobie Smulders",
            "Neil Patrick Harris",
            "Alyson Hannigan",
            "Lyndsy Fonseca",
            "David Henrie",
            "Cristin Milioti",
            "Marshall Manesh",
            "Joe Nieves"
        ],
        "rating": 8.3,
        "plot": "Ted Mosby sits down with his kids, to tell them the story of how he met their mother. The story is told through memories of his friends Marshall, Lily, Robin, and Barney Stinson. All legendary 9 seasons lead up to the moment of Ted's final encounter with \"the one.\"",
        "runtime": [
            "23"
        ],
        "num_episodes": "208"
    },
    {
        "title": "The Simpsons",
        "year": 1989,
        "genres": [
            "Animation",
            "Comedy"
        ],
        "directors": [],
        "cast": [
            "Dan Castellaneta",
            "Julie Kavner",
            "Nancy Cartwright",
            "Harry Shearer",
            "Yeardley Smith",
            "Hank Azaria",
            "Pamela Hayden",
            "Tress MacNeille",
            "Chris Edgerly",
            "Maggie Roswell"
        ],
        "rating": 8.7,
        "plot": "This is an animated sitcom about the antics of a dysfunctional family. Homer is the oafish unhealthy beer loving father, Marge is the hardworking homemaker wife, Bart is the perpetual ten-year-old underachiever (and proud of it), Lisa is the unappreciated eight-year-old genius, and Maggie is the cute, pacifier loving silent infant.",
        "runtime": [
            "22"
        ],
        "num_episodes": ""
    },
    {
        "title": "South Park",
        "year": 1997,
        "genres": [
            "Animation",
            "Comedy"
        ],
        "directors": [],
        "cast": [
            "Trey Parker",
            "Matt Stone",
            "Mona Marshall",
            "April Stewart",
            "Isaac Hayes",
            "Adrien Beard",
            "Eliza Schneider",
            "Jennifer Howell",
            "Jessica Makinson",
            "Mary Kay Bergman"
        ],
        "rating": 8.7,
        "plot": "The curious, adventure-seeking group of 10-year-old fourth-grade boys--Stan, Kyle, Cartman, and Kenny--all join in on buffoonish adventures that sometimes evolve nothing. Sometimes, something that was simply at the start spins right out of control. Everything is odd in the small mountain town of South Park, and the boys always find something to do with it.",
        "runtime": [
            "22"
        ],
        "num_episodes": ""
    },
    {
        "title": "Family Guy",
        "year": 1999,
        "genres": [
            "Animation",
            "Comedy"
        ],
        "directors": [],
        "cast": [
            "Seth MacFarlane",
            "Alex Borstein",
            "Seth Green",
            "Mila Kunis",
            "Mike Henry",
            "John Viener",
            "Patrick Warburton",
            "Danny Smith",
            "Ralph Garman",
            "Alec Sulkin"
        ],
        "rating": 8.1,
        "plot": "Sick, twisted, and politically incorrect, the animated series features the adventures of the Griffin family. Endearingly ignorant Peter and his homemaker wife Lois reside in Quahog, Rhode Island with their three kids. Meg, their eldest, is a social outcast; teenage Chris is awkward and clueless about girls; and the youngest, Stewie, is a genius baby bent on killing his mother and destroying the world. Their talking dog Brian keeps Stewie in check while sipping martinis and sorting through his own life issues.",
        "runtime": [
            "22"
        ],
        "num_episodes": ""
    },
    {
        "title": "Supernatural",
        "year": 2005,
        "genres": [
            "Drama",
            "Fantasy",
            "Horror",
            "Mystery",
            "Thriller"
        ],
        "directors": [],
        "cast": [
            "Jared Padalecki",
            "Jensen Ackles",
            "Misha Collins",
            "Mark Sheppard",
            "Jim Beaver",
            "Alexander Calvert",
            "Mark Pellegrino",
            "Samantha Smith",
            "Ruth Connell",
            "Rob Benedict"
        ],
        "rating": 8.4,
        "plot": "John Winchester raised his two sons Sam and Dean to hunt and kill all things that go \"bump in the night\" after his wife Mary was murdered by an evil supernatural being when the boys were little. 22 years later the brothers set out on a journey, fighting evil along the way, to find their recently-missing father; when they finally do he reveals he knows what demon killed their mother and has found a way to track and kill it. Meanwhile, Sam develops frightening abilities such as seeing visions of people dying before it actually happens. These visions are somehow connected to the demon that murdered his mother and its mysterious plans that seem to be all about Sam. When their father dies striking a deal with that very same demon, the brothers determine to finish his crusade. But disturbing revelations about Sam's part in the demon's apocalyptic plan are presented when John's dying last words to Dean are revealed.",
        "runtime": [
            "44"
        ],
        "num_episodes": "327"
    },
    {
        "title": "The Middle",
        "year": 2009,
        "genres": [
            "Comedy",
            "Family"
        ],
        "directors": [],
        "cast": [
            "Patricia Heaton",
            "Neil Flynn",
            "Charlie McDermott",
            "Eden Sher",
            "Atticus Shaffer",
            "Beau Wirick",
            "Brock Ciarlelli",
            "Chris Kattan",
            "Jen Ray",
            "John Gammon"
        ],
        "rating": 7.7,
        "plot": "Following a woman named Frankie, and her boisterous family, the Hecks. Her husband, Mike, her daughter, Sue, and her two sons, Axl, and Brick go on what you might call family adventures as they explore life and its meaning. Mike and Frankie Heck watch their three crazy children grow up into young adults.",
        "runtime": [
            "22"
        ],
        "num_episodes": "215"
    },
    {
        "title": "Fresh Off the Boat",
        "year": 2015,
        "genres": [
            "Comedy"
        ],
        "directors": [],
        "cast": [
            "Randall Park",
            "Constance Wu",
            "Hudson Yang",
            "Forrest Wheeler",
            "Ian Chen",
            "Lucille Soong",
            "Chelsey Crisp",
            "Ray Wise",
            "Trevor Larcom",
            "Evan Hannemann"
        ],
        "rating": 7.8,
        "plot": "Loosely based on the life of Eddie Huang during the mid-to-late 1990s, an Asian-American family decides to move to Orlando, Florida from Washington D.C. in order to embrace the \"American Dream,\" facing many obstacles as they try to assimilate with the new culture that surrounds them.",
        "runtime": [
            "22"
        ],
        "num_episodes": "116"
    },
    {
        "title": "Glee",
        "year": 2009,
        "genres": [
            "Comedy",
            "Drama",
            "Music",
            "Musical"
        ],
        "directors": [],
        "cast": [
            "Chris Colfer",
            "Jane Lynch",
            "Lea Michele",
            "Matthew Morrison",
            "Kevin McHale",
            "Naya Rivera",
            "Jenna Ushkowitz",
            "Amber Riley",
            "Mark Salling",
            "Heather Elizabeth Morris"
        ],
        "rating": 6.8,
        "plot": "When high school Spanish teacher Will Schuester (Matthew Morrison) becomes the director of the school's failing Glee club, New Directions, he hopes to be able to rejuvenate it. The club competes in the choir competition circuit. It's been called \"a High School Musical for adults\", the series follows the club and its mixture of oddball members as they try and restore it to its former glory. It is a musical comedy in which the eager and ambitious students not only compete to win the Nationals, but also have to deal with the tough and cruel realities of their school, McKinley High. At the same time, Will is trying to rejuvenate his failing love life while preventing the school's cheer leading coach Sue Sylvester (Jane Lynch) from sabotaging the choir.",
        "runtime": [
            "44"
        ],
        "num_episodes": "121"
    },
    {
        "title": "Malcolm in the Middle",
        "year": 2000,
        "genres": [
            "Comedy",
            "Family"
        ],
        "directors": [],
        "cast": [
            "Bryan Cranston",
            "Justin Berfield",
            "Erik Per Sullivan",
            "Frankie Muniz",
            "Christopher Masterson",
            "Jane Kaczmarek",
            "Craig Lamar Traylor",
            "David Anthony Higgins",
            "James Rodriguez",
            "Lukas Rodriguez"
        ],
        "rating": 8.2,
        "plot": "A young male has trouble living with his strange and wild family as he does his best to build and live his life in the best way possible. From time to time, he has to help each of his family members whenever they get into trouble. It always leads to unexpected adventures.",
        "runtime": [
            "22"
        ],
        "num_episodes": "151"
    },
    {
        "title": "Two and a Half Men",
        "year": 2003,
        "genres": [
            "Comedy",
            "Romance"
        ],
        "directors": [],
        "cast": [
            "Jon Cryer",
            "Angus T. Jones",
            "Conchata Ferrell",
            "Charlie Sheen",
            "Holland Taylor",
            "Ashton Kutcher",
            "Marin Hinkle",
            "Melanie Lynskey",
            "Courtney Thorne-Smith",
            "Jennifer Taylor"
        ],
        "rating": 7.1,
        "plot": "The Harper brothers Charlie and Alan are almost opposites but form a great team. They have little in common except their dislike for their mundane, maternally cold and domineering mother, Evelyn. Alan, a compulsively neat chiropractor and control-freak, is thrown out by his manipulative wife Judith who nevertheless gets him to pay for everything and do most jobs in the house. Charlie is a freelance jingle composer and irresistible Cassanova who lives in a luxurious beach-house and rarely gets up before noon. Charlie \"temporarily\" allows Alan and his son Jake, a food-obsessed, lazy kid who shuttles between his parents, to move in with them after Alan's separation/divorce. The sitcom revolves around their conflicting lifestyles, raising Jake (who has the efficient, caring dad while having a ball with his fun-loving sugar uncle who teaches him boyish things), and bantering with Evelyn and various other friends and family. Other fairly regular characters include Charlie's cleaning lady Berta and his rich, self-confessed stalker neighbor Rose who often sneaks in to spy on Charlie.",
        "runtime": [
            "22"
        ],
        "num_episodes": "262"
    },
    {
        "title": "Riverdale",
        "year": 2017,
        "genres": [
            "Crime",
            "Drama",
            "Mystery",
            "Romance"
        ],
        "directors": [],
        "cast": [
            "Lili Reinhart",
            "Camila Mendes",
            "Cole Sprouse",
            "KJ Apa",
            "Madelaine Petsch",
            "Casey Cott",
            "Mädchen Amick",
            "Vanessa Morgan",
            "Charles Melton",
            "Drew Ray Tanner"
        ],
        "rating": 6.5,
        "plot": "After the death of one of the rich and popular Blossom twins on the 4th of July, the small town of Riverdale investigates the murder. The series starts in September, the beginning of a new school year, that brings with it new students, relationships, and reveals the mysteries of the past 4th of July.",
        "runtime": [
            "45"
        ],
        "num_episodes": "137"
    },
    {
        "title": "Alfred Hitchcock Presents",
        "year": 1955,
        "genres": [
            "Crime",
            "Drama",
            "Mystery",
            "Thriller"
        ],
        "directors": [],
        "cast": [
            "Alfred Hitchcock",
            "Harry Tyler",
            "Lillian O'Malley",
            "John Williams",
            "Patricia Hitchcock",
            "Arthur Gould-Porter",
            "Raymond Bailey",
            "Russell Collins",
            "Robert Carson",
            "Barry Harvey"
        ],
        "rating": 8.5,
        "plot": "Alfred Hitchcock, the Master of Suspense hosts his own television show. Hitchcock introduced the show, which was then followed by a short half an hour episode which contained suspense, horror, and humor. After the story, Hitchcock would come back and end the show.",
        "runtime": [
            "25"
        ],
        "num_episodes": "268"
    },
    {
        "title": "The Alfred Hitchcock Hour",
        "year": 1962,
        "genres": [
            "Crime",
            "Drama",
            "Horror",
            "Mystery",
            "Thriller"
        ],
        "directors": [],
        "cast": [
            "Alfred Hitchcock",
            "Hinton Pope",
            "Jimmy Joyce",
            "Lew Brown",
            "Robert Reiner",
            "Alice Backes",
            "Dee J. Thompson",
            "Gail Bonney",
            "Brendan Dillon",
            "Myron Healey"
        ],
        "rating": 8.5,
        "plot": "\"The Alfred Hitchcock Hour\" was a continuation of the dramatic anthology series hosted by the Master of Suspense and Mystery. When the series Alfred Hitchcock Presents was revived in 1962, the name was changed, but the format stayed fairly true to the original. In each episode, viewers would be strung along with the story, never knowing which way the final twist would turn.",
        "runtime": [
            "50"
        ],
        "num_episodes": "93"
    },
    {
        "title": "Night Gallery",
        "year": 1969,
        "genres": [
            "Drama",
            "Fantasy",
            "Horror",
            "Mystery",
            "Sci-Fi",
            "Thriller"
        ],
        "directors": [],
        "cast": [
            "Rod Serling",
            "Larry Watson",
            "Joanna Pettet",
            "Matt Pelto",
            "Gary Collins",
            "Susan Strasberg",
            "Geraldine Page",
            "John Astin",
            "Michael Laird",
            "Alan Napier"
        ],
        "rating": 7.9,
        "plot": "Similar in format to Serling's much more famous \"Twilight Zone\" series. Each week we get a new tale, represented by a painting in an old museum. Whereas the tales in \"Twilight Zone\" were more science fiction, these tales have a darker, more horrific edge.",
        "runtime": [
            "50"
        ],
        "num_episodes": "52"
    },
    {
        "title": "Agents of S.H.I.E.L.D.",
        "year": 2013,
        "genres": [
            "Action",
            "Adventure",
            "Drama",
            "Sci-Fi",
            "Thriller"
        ],
        "directors": [],
        "cast": [
            "Clark Gregg",
            "Ming-Na Wen",
            "Chloe Bennet",
            "Elizabeth Henstridge",
            "Iain De Caestecker",
            "Henry Simmons",
            "Brett Dalton",
            "Natalia Cordova-Buckley",
            "Jeff Ward",
            "Nick Blood"
        ],
        "rating": 7.5,
        "plot": "After the Battle of New York, the world has changed. It now knows not only about the Avengers, but also the powerful menaces that require those superheroes and more to face them. In response, Phil Coulson of the Strategic Homeland Intervention, Enforcement and Logistics Division assembles an elite covert team to find and deal with these threats wherever they are found. With a world rapidly becoming more bizarre and dangerous than ever before as the supervillains arise, these agents of S.H.I.E.L.D. are ready to take them on.",
        "runtime": [
            "45"
        ],
        "num_episodes": "136"
    },
    {
        "title": "The Flash",
        "year": 2014,
        "genres": [
            "Action",
            "Adventure",
            "Drama",
            "Sci-Fi"
        ],
        "directors": [],
        "cast": [
            "Grant Gustin",
            "Candice Patton",
            "Danielle Panabaker",
            "Jesse L. Martin",
            "Carlos Valdes",
            "Tom Cavanagh",
            "Danielle Nicolet",
            "Kayla Compton",
            "Brandon McKnight",
            "Hartley Sawyer"
        ],
        "rating": 7.5,
        "plot": "Barry Allen was struck by lightning and fell into a coma. When he awakens from it 9 months later, he meets Cisco Ramon, Harrison Wells, and Caitlin Snow, and later he realizes that he that he has powers and how it had been caused by the explosion of the particle accelerator.",
        "runtime": [
            "43"
        ],
        "num_episodes": "184"
    },
    {
        "title": "Heroes",
        "year": 2006,
        "genres": [
            "Crime",
            "Drama",
            "Fantasy",
            "Mystery",
            "Sci-Fi",
            "Thriller"
        ],
        "directors": [],
        "cast": [
            "Jack Coleman",
            "Hayden Panettiere",
            "Milo Ventimiglia",
            "Masi Oka",
            "Sendhil Ramamurthy",
            "Greg Grunberg",
            "James Kyson",
            "Adrian Pasdar",
            "Zachary Quinto",
            "Ali Larter"
        ],
        "rating": 7.5,
        "plot": "People all over the U.S and the world start to realize they have special abilities, like telekinesis, healing abilities, flying powers, time travel, invisibility, and the ability to absorb other's abilities. One man, known as Sylar, wants to gain all the power of these \"heroes\" so he can be the most powerful and evolved human of all, and stops at nothing to gruesomely kill these people. In order to protect themselves from him, these people must help one another before Sylar can destroy them all, while they each deal with problems of their own.",
        "runtime": [
            "45"
        ],
        "num_episodes": "78"
    },
    {
        "title": "True Blood",
        "year": 2008,
        "genres": [
            "Drama",
            "Fantasy",
            "Mystery",
            "Romance",
            "Thriller"
        ],
        "directors": [],
        "cast": [
            "Anna Paquin",
            "Stephen Moyer",
            "Sam Trammell",
            "Ryan Kwanten",
            "Chris Bauer",
            "Nelsan Ellis",
            "Carrie Preston",
            "Rutina Wesley",
            "Alexander Skarsgård",
            "Deborah Ann Woll"
        ],
        "rating": 7.9,
        "plot": "Set in modern times, vampires roam the Earth and are humans' mortal enemies. However, a substitute has been found for human blood, a substitute that vampires can consume with the same effect as human blood. This is True Blood. Now humans and vampires can co-exist in harmony, and even form relationships. But there will always be rogue elements on both sides ready to exploit the uneasy truce.",
        "runtime": [
            "55"
        ],
        "num_episodes": "81"
    },
    {
        "title": "Fringe",
        "year": 2008,
        "genres": [
            "Drama",
            "Mystery",
            "Sci-Fi",
            "Thriller"
        ],
        "directors": [],
        "cast": [
            "Anna Torv",
            "Joshua Jackson",
            "Jasika Nicole",
            "John Noble",
            "Lance Reddick",
            "Blair Brown",
            "Michael Cerveris",
            "Kirk Acevedo",
            "Seth Gabel",
            "Ryan McDonald"
        ],
        "rating": 8.4,
        "plot": "The FBI teams up with a formerly-institutionalized scientist--who was performing experiments on the fringe of real science--and his son to investigate weird crimes that are seemingly part of a larger pattern, and could be connected with a global company called Massive Dynamic.",
        "runtime": [
            "46"
        ],
        "num_episodes": "100"
    },
    {
        "title": "Gotham",
        "year": 2014,
        "genres": [
            "Action",
            "Crime",
            "Drama",
            "Mystery",
            "Sci-Fi",
            "Thriller"
        ],
        "directors": [],
        "cast": [
            "Ben McKenzie",
            "Donal Logue",
            "David Mazouz",
            "Robin Lord Taylor",
            "Camren Bicondova",
            "Cory Michael Smith",
            "Sean Pertwee",
            "Erin Richards",
            "Morena Baccarin",
            "Chris Chalk"
        ],
        "rating": 7.8,
        "plot": "In crime ridden Gotham City, Thomas and Martha Wayne are murdered before young Bruce Wayne's eyes. Although Gotham City Police Department detectives, James Gordon, and his cynical partner, Harvey Bullock, seem to solace's the case quickly, things are not so simple. Inspired by Bruce's traumatized desire for justice, Gordon vows to find it amid Gotham's corruption. Thus begins Gordon's lonely quest that would set him against his own comrades and the underworld with their own deadly rivalries and mysteries. In the coming wars, innocence will be lost and compromises will be made as some criminals will fall as casualties while others will rise as super villains. All the while, young Bruce observes this war with a growing obsession that would one day drive him to seek his own justice against the evil of Gotham as The Batman.",
        "runtime": [
            "42"
        ],
        "num_episodes": "100"
    },
    {
        "title": "The O.C.",
        "year": 2003,
        "genres": [
            "Comedy",
            "Drama",
            "Romance"
        ],
        "directors": [],
        "cast": [
            "Peter Gallagher",
            "Kelly Rowan",
            "Ben McKenzie",
            "Adam Brody",
            "Rachel Bilson",
            "Melinda Clarke",
            "Mischa Barton",
            "Tate Donovan",
            "Alan Dale",
            "Autumn Reeser"
        ],
        "rating": 7.6,
        "plot": "A troubled teen named Ryan is taken in by a public defense lawyer and his rich real estate developer wife in Newport Beach, California after he is kicked out and abandoned by his alchoholic and unstable mother. He meets their quick-witted son Seth and they soon become best friends.",
        "runtime": [
            "44"
        ],
        "num_episodes": "92"
    },
    {
        "title": "Once Upon a Time",
        "year": 2011,
        "genres": [
            "Adventure",
            "Fantasy",
            "Romance"
        ],
        "directors": [],
        "cast": [
            "Lana Parrilla",
            "Robert Carlyle",
            "Jared Gilmore",
            "Jennifer Morrison",
            "Ginnifer Goodwin",
            "Josh Dallas",
            "Colin O'Donoghue",
            "Emilie de Ravin",
            "Rebecca Mader",
            "Beverley Elliott"
        ],
        "rating": 7.7,
        "plot": "For Emma Swan, life has been anything but a happy ending. But when she's reunited with Henry - the son she gave up for adoption ten years ago - on the night of her 28th birthday, everything changes. The now 10-year-old Henry is in desperate need of Emma's help because he believes from reading a book of fairy-tales that she's the daughter of Snow White and Prince Charming - who sent her away from the Enchanted Forest to be protected from a curse that was enacted by the Evil Queen. Emma initially refuses to believe a word of Henry's story but soon finds that his hometown of Storybrooke, Maine is more than it seems. Because it's in Storybrooke that all of the classic characters we know are frozen in time with no memories of their former selves - except for the Evil Queen, who is Storybrooke's mayor and Henry's adoptive mother Regina Mills. Now, as the epic \"Final Battle\" for the future of both worlds approaches, Emma will have to accept her destiny and uncover the mystery behind a place where fairy-tales are to be believed.",
        "runtime": [
            "60"
        ],
        "num_episodes": "156"
    },
    {
        "title": "Doctor Who",
        "year": 2005,
        "genres": [
            "Adventure",
            "Drama",
            "Sci-Fi"
        ],
        "directors": [],
        "cast": [
            "David Tennant",
            "Matt Smith",
            "Nicholas Briggs",
            "Jon Davey",
            "Peter Capaldi",
            "Jenna Coleman",
            "Paul Kasey",
            "Karen Gillan",
            "Billie Piper",
            "Jodie Whittaker"
        ],
        "rating": 8.5,
        "plot": "The Doctor, a Time Lord from the race whose home planet is Gallifrey, travels through time and space in their ship the TARDIS (an acronym for Time and Relative Dimension In Space) with numerous companions. From time to time, the Doctor regenerates into a new form.",
        "runtime": [
            "45"
        ],
        "num_episodes": "175"
    },
    {
        "title": "SEAL Team",
        "year": 2017,
        "genres": [
            "Action",
            "Drama",
            "War"
        ],
        "directors": [],
        "cast": [
            "David Boreanaz",
            "Neil Brown Jr.",
            "A.J. Buckley",
            "Toni Trucks",
            "Justin Melnick",
            "Tyler Grey",
            "Max Thieriot",
            "Judd Lormand",
            "Jessica Paré",
            "Dita The Hair Missile Dog"
        ],
        "rating": 7.8,
        "plot": "SEAL Team is a military drama that follows the professional and personal lives of the most elite unit of Navy SEALs as they train, plan, and execute the most dangerous high-stakes missions our country can ask of them. Jason Hayes is the respected, intense leader of the Tier One team whose home life has suffered as a result of his extensive warrior's existence. His team includes his trusted confidant Ray Perry, the longest-tenured operator with whom Jason shares an ingrained shorthand; Sonny Quinn, an exceptional, loyal soldier with a checkered past who still combats self-destructive tendencies; and Clay Spenser, a young, multilingual, second-generation SEAL with insatiable drive and dedication. Vital to the team's success are troop commander Lt. Cdr. Eric Blackburn, who serves as a leader and confidant both on and off the battlefield; CIA analyst Mandy Ellis, who has sacrificed everything in her drive to root out evil and take down terrorists; and Ensign Lisa Davis, a no-nonsense, take-charge officer. Deployed on clandestine missions worldwide at a moment's notice, and knowing the toll it takes on them and their families, this tight-knit SEAL team displays unwavering patriotism and fearless dedication even in the face of overwhelming odds.",
        "runtime": [
            "43"
        ],
        "num_episodes": "114"
    },
    {
        "title": "Leverage",
        "year": 2008,
        "genres": [
            "Crime",
            "Mystery",
            "Thriller"
        ],
        "directors": [],
        "cast": [
            "Timothy Hutton",
            "Gina Bellman",
            "Christian Kane",
            "Beth Riesgraf",
            "Aldis Hodge",
            "Mark Sheppard",
            "Jeri Ryan",
            "Gerald Downey",
            "Robert Blanche",
            "Elisabetta Canalis"
        ],
        "rating": 7.9,
        "plot": "Former insurance-claims investigator Nathan Ford heads a team of former top-criminals. They handle 'unorthodox' cases of people unlikely to get their due through regular channels and legal procedures. That often involves stinging or otherwise scamming criminals. Nate's team is altered at times, and his professional as well as personal past repeatedly seems to catch up.",
        "runtime": [
            "42"
        ],
        "num_episodes": "77"
    },
    {
        "title": "Daredevil",
        "year": 2015,
        "genres": [
            "Action",
            "Crime",
            "Drama",
            "Fantasy",
            "Sci-Fi",
            "Thriller"
        ],
        "directors": [],
        "cast": [
            "Charlie Cox",
            "Deborah Ann Woll",
            "Elden Henson",
            "Vincent D'Onofrio",
            "Royce Johnson",
            "Geoffrey Cantor",
            "Jay Ali",
            "Jon Bernthal",
            "Stephen Rider",
            "Wilson Bethel"
        ],
        "rating": 8.6,
        "plot": "As a child Matt Murdock was blinded by a chemical spill in a freak accident. Instead of limiting him it gave him superhuman senses that enabled him to see the world in a unique and powerful way. Now he uses these powers to deliver justice, not only as a lawyer in his own law firm, but also as vigilante at night, stalking the streets of Hell's Kitchen as Daredevil, the man without fear.",
        "runtime": [
            "60"
        ],
        "num_episodes": "39"
    },
    {
        "title": "Sons of Anarchy",
        "year": 2008,
        "genres": [
            "Crime",
            "Drama",
            "Thriller"
        ],
        "directors": [],
        "cast": [
            "Charlie Hunnam",
            "Katey Sagal",
            "Mark Boone Junior",
            "Kim Coates",
            "Tommy Flanagan",
            "Theo Rossi",
            "Dayton Callie",
            "Maggie Siff",
            "Ron Perlman",
            "David Labrava"
        ],
        "rating": 8.6,
        "plot": "Sons of Anarchy, aka SAMCRO, is a motorcycle club that operates both illegal and legal businesses in the small town of Charming. They combine gun-running and a garage, plus involvement in porn film. Clay, the president, likes it old school and violent; while Jax, his stepson and the club's VP, has thoughts about changing the way things are, based on his dead father's journal. Their conflict has effects on both the club and their personal relationships.",
        "runtime": [
            "45"
        ],
        "num_episodes": "92"
    },
    {
        "title": "Forensic Files",
        "year": 1996,
        "genres": [
            "Documentary",
            "Crime"
        ],
        "directors": [],
        "cast": [
            "Peter Thomas",
            "Tom Bevel",
            "Skip Palenik",
            "Lowell Levine",
            "Mary Case",
            "Kim Rossmo",
            "Cyril H. Wecht",
            "Henry C. Lee",
            "Neal Haskell",
            "Trey Gowdy"
        ],
        "rating": 8.8,
        "plot": "Police increasingly utilize scientific laboratory analysis to solve crimes. This program reviews and re-enacts dramatic cases from around the world in which forensic scientists find and examine previously undetectable evidence. Through their hard work, criminals are brought to justice and the innocent are set free.",
        "runtime": [
            "30"
        ],
        "num_episodes": "407"
    },
    {
        "title": "The Shield",
        "year": 2002,
        "genres": [
            "Crime",
            "Drama",
            "Thriller"
        ],
        "directors": [],
        "cast": [
            "Michael Chiklis",
            "Michael Jace",
            "Jay Karnes",
            "CCH Pounder",
            "Benito Martinez",
            "Walton Goggins",
            "Catherine Dent",
            "Cathy Cahlin Ryan",
            "David Rees Snell",
            "Kenny Johnson"
        ],
        "rating": 8.7,
        "plot": "The story of an inner-city Los Angeles police precinct where some of the cops aren't above breaking the rules or working against their associates to both keep the streets safe and their self-interests intact.",
        "runtime": [
            "45"
        ],
        "num_episodes": "89"
    },
    {
        "title": "The Walking Dead",
        "year": 2010,
        "genres": [
            "Drama",
            "Horror",
            "Thriller"
        ],
        "directors": [],
        "cast": [
            "Norman Reedus",
            "Melissa McBride",
            "Lauren Cohan",
            "Christian Serratos",
            "Josh McDermitt",
            "Danai Gurira",
            "Seth Gilliam",
            "Andrew Lincoln",
            "Ross Marquand",
            "Chandler Riggs"
        ],
        "rating": 8.1,
        "plot": "Sheriff Deputy Rick Grimes gets shot and falls into a coma. When awoken he finds himself in a Zombie Apocalypse. Not knowing what to do he sets out to find his family, after he's done that, he gets connected to a group to become the leader. He takes charge and tries to help this group of people survive, find a place to live and get them food. This show is all about survival, the risks and the things you'll have to do to survive.",
        "runtime": [
            "45"
        ],
        "num_episodes": "177"
    },
    {
        "title": "The Americans",
        "year": 2013,
        "genres": [
            "Crime",
            "Drama",
            "Mystery",
            "Thriller"
        ],
        "directors": [],
        "cast": [
            "Keri Russell",
            "Matthew Rhys",
            "Keidrich Sellati",
            "Holly Taylor",
            "Noah Emmerich",
            "Costa Ronin",
            "Lev Gorn",
            "Richard Thomas",
            "Alison Wright",
            "Brandon J. Dirden"
        ],
        "rating": 8.4,
        "plot": "A pair of deep-cover Soviet spies masquerades as a typical DC couple whose children, neighbors, coworkers, and friends are completely unaware of their activities. At home, they're the stereotypical parents of stereotypical kids; at work, they pose as travel agents; but at night, they weave a web of confidantes, lovers, dupes, and historical figures from the Reagan-era Cold War. The startlingly realistic plot twists force the viewer to consider the real cost of an undeclared war, what it takes to protect one's beliefs, if it's worth it, and if it actually worked for either side.",
        "runtime": [
            "44"
        ],
        "num_episodes": "75"
    },
    {
        "title": "Babylon 5",
        "year": 1993,
        "genres": [
            "Action",
            "Adventure",
            "Drama",
            "Sci-Fi"
        ],
        "directors": [],
        "cast": [
            "Mira Furlan",
            "Richard Biggs",
            "Stephen Furst",
            "Andreas Katsulas",
            "Peter Jurasik",
            "Jerry Doyle",
            "Bill Mumy",
            "Bruce Boxleitner",
            "Claudia Christian",
            "Jeff Conaway"
        ],
        "rating": 8.4,
        "plot": "In the year 2258, it is ten years after the Earth-Minbari War. Commander Sinclair takes command of a giant five-mile-long cylindrical space station, orbiting a planet in neutral space. At a crossroads of interstellar commerce and diplomacy, Commander Sinclair (2nd season Captain Sheridan) must try to establish peace and prosperity between various interstellar empires, all the while fighting forces from within the Earth Alliance. It is a precarious command, particularly given that sabotage led to the destruction of Babylon stations 1, 2, and 3 and 4 vanished without trace.",
        "runtime": [
            "45"
        ],
        "num_episodes": "111"
    },
    {
        "title": "Brooklyn Nine-Nine",
        "year": 2013,
        "genres": [
            "Comedy",
            "Crime"
        ],
        "directors": [],
        "cast": [
            "Andy Samberg",
            "Stephanie Beatriz",
            "Terry Crews",
            "Melissa Fumero",
            "Joe Lo Truglio",
            "Andre Braugher",
            "Dirk Blocker",
            "Joel McKinnon Miller",
            "Chelsea Peretti",
            "Marc Evan Jackson"
        ],
        "rating": 8.4,
        "plot": "Captain Ray Holt takes over Brooklyn's 99th precinct, which includes Detective Jake Peralta, a talented but carefree detective who's used to doing whatever he wants. The other employees of the 99th precinct include Detective Amy Santiago, Jake's over achieving and competitive partner; Detective Rosa Diaz, a tough and kept to herself coworker; Detective Charles Boyle, Jake's best friend who also has crush on Rosa; Detective Sergeant Terry Jeffords, who was recently taken off the field after the birth of his twin girls; and Gina Linetti, the precinct's sarcastic administrator.",
        "runtime": [
            "22"
        ],
        "num_episodes": "153"
    },
    {
        "title": "13 Reasons Why",
        "year": 2017,
        "genres": [
            "Drama",
            "Mystery",
            "Thriller"
        ],
        "directors": [],
        "cast": [
            "Dylan Minnette",
            "Christian Navarro",
            "Alisha Boe",
            "Brandon Flynn",
            "Justin Prentice",
            "Ross Butler",
            "Devin Druid",
            "Amy Hargreaves",
            "Miles Heizer",
            "Timothy Granaderos"
        ],
        "rating": 7.5,
        "plot": "Thirteen Reasons Why, based on the best-selling books by Jay Asher, follows teenager Clay Jensen (Dylan Minnette) as he returns home from school to find a mysterious box with his name on it lying on his porch. Inside he discovers a group of cassette tapes recorded by Hannah Baker (Katherine Langford) -his classmate and crush-who tragically committed suicide two weeks earlier. On tape, Hannah unfolds an emotional audio diary, detailing the thirteen reasons why she decided to end her life. Through Hannah and Clay's dual narratives, Thirteen Reasons Why weaves an intricate and heartrending story of confusion and desperation that will deeply affect viewers.",
        "runtime": [
            "60"
        ],
        "num_episodes": "49"
    },
    {
        "title": "2 Broke Girls",
        "year": 2011,
        "genres": [
            "Comedy"
        ],
        "directors": [],
        "cast": [
            "Kat Dennings",
            "Beth Behrs",
            "Garrett Morris",
            "Jonathan Kite",
            "Matthew Moy",
            "Jennifer Coolidge",
            "Ed Quinn",
            "Patrick Cox",
            "Ryan Hansen",
            "Nick Zano"
        ],
        "rating": 6.7,
        "plot": "Sassy, streetwise Max works two jobs just to get by, one of which is waiting tables during the night shift at the retro-hip Williamsburg Diner. Sophisticated Caroline is an uptown trust-fund princess who's having a run of bad luck that forces her to reluctantly give waitressing a shot. At first, Max sees Caroline as yet another in a long line of inept servers she must cover for, but she's surprised to find that Caroline has as much substance as she does style. When Caroline discovers Max's knack for baking amazing cupcakes, she sees a lucrative future for them, but first they must raise the start-up money.",
        "runtime": [
            "22"
        ],
        "num_episodes": "138"
    },
    {
        "title": "SpongeBob SquarePants",
        "year": 1999,
        "genres": [
            "Animation",
            "Comedy",
            "Family",
            "Fantasy"
        ],
        "directors": [],
        "cast": [
            "Tom Kenny",
            "Rodger Bumpass",
            "Bill Fagerbakke",
            "Clancy Brown",
            "Mr. Lawrence",
            "Dee Bradley Baker",
            "Carolyn Lawrence",
            "Jill Talley",
            "Sirena Irwin",
            "Mary Jo Catlett"
        ],
        "rating": 8.2,
        "plot": "The character-driven cartoon chronicles the nautical and often nonsensical adventures of SpongeBob, an incurably optimistic and earnest sea sponge, and his underwater friends. Dwelling a few fathoms beneath the tropical isle of Bikini Atoll in the sub-surface city of Bikini Bottom, SpongeBob lives in a two-story pineapple. Instead of taking the logical approach to everyday challenges, SpongeBob approaches life in a wayward and unconventional way. Whether searching for the ultimate spatula to perfect his burger flipping technique at the Krusty Krab or just hanging out with his best friend Patrick (an amiable starfish), SpongeBob's good intentions and overzealous approach to life usually create chaos in his underwater world.",
        "runtime": [
            "23"
        ],
        "num_episodes": ""
    },
    {
        "title": "The King of Queens",
        "year": 1998,
        "genres": [
            "Comedy"
        ],
        "directors": [],
        "cast": [
            "Kevin James",
            "Leah Remini",
            "Jerry Stiller",
            "Victor Williams",
            "Patton Oswalt",
            "Gary Valentine",
            "Nicole Sullivan",
            "Larry Romano",
            "Merrin Dungey",
            "Mookie Barker"
        ],
        "rating": 7.4,
        "plot": "Three's definitely a crowd for parcel-post deliveryman Doug Heffernan (Kevin James), whose newly-widowed father-in-law Arthur (Jerry Stiller) has moved in with him and his wife Carrie (Leah Remini). Doug's no longer the king of his domain--the renovated basement that houses his beloved supersized TV set--let alone the king of Queens, where he lives. Can they all just get along?",
        "runtime": [
            "22"
        ],
        "num_episodes": "207"
    },
    {
        "title": "The Twilight Zone",
        "year": 1959,
        "genres": [
            "Drama",
            "Fantasy",
            "Horror",
            "Mystery",
            "Sci-Fi",
            "Thriller"
        ],
        "directors": [],
        "cast": [
            "Rod Serling",
            "Robert McCord",
            "Jay Overholts",
            "James Turley",
            "Vaughn Taylor",
            "David Armstrong",
            "Jack Klugman",
            "Burgess Meredith",
            "John Anderson",
            "J. Pat O'Malley"
        ],
        "rating": 9.0,
        "plot": "The Twilight Zone is a place that exists at any moment of time, of space or of mind....but always when you least expect it. When you find yourself in this realm of unlimited possibility, be careful what you say or do. The right decisions may help you find your way back out....sometimes with greater happiness and wealth. The wrong decisions often lead to madness and death, or an eternity trapped in this dimension. Tread warily past the sign post ahead that says you've entered, The Twilight Zone",
        "runtime": [
            "50"
        ],
        "num_episodes": "156"
    },
    {
        "title": "Empire",
        "year": 2015,
        "genres": [
            "Drama",
            "Music"
        ],
        "directors": [],
        "cast": [
            "Terrence Howard",
            "Bryshere Y. Gray",
            "Trai Byers",
            "Taraji P. Henson",
            "Ta'Rhonda Jones",
            "Gabourey Sidibe",
            "Serayah",
            "Jussie Smollett",
            "Grace Byers",
            "Andre Royo"
        ],
        "rating": 7.4,
        "plot": "Lucious, the founder and CEO of a successful record label, has been diagnosed with ALS. He must choose one of his three sons to take over the company when he dies. Meanwhile, his ex-wife and co-founder Cookie has been released from prison and wants to reclaim her rightful place in the company.",
        "runtime": [
            "42"
        ],
        "num_episodes": "103"
    },
    {
        "title": "Downton Abbey",
        "year": 2010,
        "genres": [
            "Drama",
            "Romance"
        ],
        "directors": [],
        "cast": [
            "Hugh Bonneville",
            "Laura Carmichael",
            "Jim Carter",
            "Brendan Coyle",
            "Michelle Dockery",
            "Joanne Froggatt",
            "Robert James-Collier",
            "Phyllis Logan",
            "Elizabeth McGovern",
            "Sophie McShera"
        ],
        "rating": 8.7,
        "plot": "Lord Robert Crawley, Earl of Grantham (Hugh Bonneville) sees his family heritage, especially the grand country home Downton Abbey, as his mission in life. The death of his heir aboard R.M.S. Titanic means distant cousin Matthew Crawley (Dan Stevens), a Manchester lawyer, suddenly is next in line and accepts moving onto the vast estate with his even more modernist, socially engaged mother, who clashes with his Lordship's domineering, conservative mother, the dowager countess. Marrying off the daughters is another concern. Meanwhile, the butler presides over a staff which serves the family, but also lead most of their entire lives in the servants' quarters, intriguing amongst themselves.",
        "runtime": [
            "60"
        ],
        "num_episodes": "52"
    },
    {
        "title": "This Is Us",
        "year": 2016,
        "genres": [
            "Comedy",
            "Drama",
            "Romance"
        ],
        "directors": [],
        "cast": [
            "Milo Ventimiglia",
            "Mandy Moore",
            "Sterling K. Brown",
            "Chrissy Metz",
            "Justin Hartley",
            "Susan Kelechi Watson",
            "Chris Sullivan",
            "Eris Baker",
            "Faithe Herman",
            "Jon Huertas"
        ],
        "rating": 8.7,
        "plot": "Rebecca Pearson once had a difficult pregnancy with triplets. The resulting births occurred on the same day as her husband Jack Pearson's thirty-sixth birthday. The lives of Rebecca, Jack and their three offspring - Kevin, Kate and Randall - are presented at different points in time. The Rebecca and Jack stories generally take place during the early stage of their marriage, surrounding the birth of the three children or at different phases of the children's upbringing, which was not always smooth sailing for any of the five. Separate stories concerning Kevin, Kate and Randall are also presented in their adult years, each who has his or her own baggage resulting from that upbringing: Kevin who was generally the neglected one because he had no outward issues; Kate who has always had weight issues; Randall, the gifted one, being the visible outsider and being the \"non-K\" child. These stories may demonstrate the emotional ties that exist not only because of being family, but also because of four of them having the same birthday and some of them having always been together, meaning since conception.",
        "runtime": [
            "45"
        ],
        "num_episodes": "106"
    },
    {
        "title": "The West Wing",
        "year": 1999,
        "genres": [
            "Drama"
        ],
        "directors": [],
        "cast": [
            "Allison Janney",
            "John Spencer",
            "Bradley Whitford",
            "Martin Sheen",
            "Janel Moloney",
            "Richard Schiff",
            "Dulé Hill",
            "NiCole Robinson",
            "Melissa Fitzgerald",
            "Rob Lowe"
        ],
        "rating": 8.9,
        "plot": "Presidential advisers get their personal lives hopelessly tangled up with professional duties as they try to conduct the business of running a country. Fictional Democratic President Josiah \"Jed\" Bartlet suffers no fools, and that policy alienates many. He and his dedicated staffers struggle to balance the needs of the country with the political realities of Washington, D.C., working through two presidential terms that include countless scandals, threats and political scuffles, as well as the race to succeed Bartlet as the leader of the free world.",
        "runtime": [
            "42"
        ],
        "num_episodes": "155"
    },
    {
        "title": "Alone",
        "year": 2015,
        "genres": [
            "Documentary",
            "Game-Show",
            "Reality-TV"
        ],
        "directors": [],
        "cast": [
            "Nicole Apelian",
            "Sam Larson",
            "Brad Richardson",
            "Jesse Bosdell",
            "Brooke Whipple",
            "Carleigh Fairchild",
            "Dave Nessia",
            "Britt Ahart",
            "Alan Kay",
            "Dan"
        ],
        "rating": 8.4,
        "plot": "Ten people try to survive as long as they can in the Vancouver Island wilderness, carrying only what can fit in a backpack. Alone in harsh, unforgiving terrain, these men must hunt, build shelters and fend off predators, all while documenting the experience themselves. It's the ultimate test of man's will.",
        "runtime": [
            "44"
        ],
        "num_episodes": ""
    },
    {
        "title": "Gomorrah",
        "year": 2014,
        "genres": [
            "Crime",
            "Drama",
            "Thriller"
        ],
        "directors": [],
        "cast": [
            "Salvatore Esposito",
            "Marco D'Amore",
            "Ivana Lotito",
            "Cristiana Dell'Anna",
            "Alessandro Palladino",
            "Fortunato Cerlino",
            "Arturo Muselli",
            "Roberto Oliveri",
            "Brian Flaccus",
            "Fabio De Caro"
        ],
        "rating": 8.6,
        "plot": "Organised crime clans fight wars and make fleeting alliances in the dynamic and ever-shifting underworld of the poverty-stricken Naples, Italy. Gennaro, the son and heir of the Savastano clan, and Ciro Di Marzio, one of this clan's officers, have great ambition to advance to ever-greater heights. The path ahead is bloody and cruel, and their families will be put at risk.",
        "runtime": [
            "45"
        ],
        "num_episodes": "58"
    },
    {
        "title": "Orphan Black",
        "year": 2013,
        "genres": [
            "Drama",
            "Sci-Fi",
            "Thriller"
        ],
        "directors": [],
        "cast": [
            "Tatiana Maslany",
            "Jordan Gavaris",
            "Maria Doyle Kennedy",
            "Kristian Bruun",
            "Kevin Hanchard",
            "Skyler Wexler",
            "Josh Vokey",
            "Ari Millen",
            "Evelyne Brochu",
            "Dylan Bruce"
        ],
        "rating": 8.3,
        "plot": "SPOILER: Orphan Black follows outsider, orphan and street-wise chameleon Sarah. After witnessing a woman's suicide, Sarah assumes the stranger's identity - who happens to look just like her. Expecting to solve all her problems by cleaning out the dead woman's savings, Sarah is instead thrust headlong into a kaleidoscopic mystery as she realizes the dizzying truth - she and the dead woman are clones. As Sarah searches for answers, she discovers the chilling fact that there are more people like her out there - genetically identical individuals who were planted in unsuspecting birth parents and nurtured in completely different circumstances. With no idea who created the clones, she'll need to discover the reason in a hurry as an assassin is killing them one by one.",
        "runtime": [
            "44"
        ],
        "num_episodes": "50"
    }
]